## Plan Result (Managed_Identity)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 0 to change, 2 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.acme-vault-access[&#34;d5bf08c7-2670-46db-b040-90a742b80316&#34;]
  * azurerm_role_assignment.acme-vault-access[&#34;ff47ab8f-e4d9-48f2-ad31-af5933824849&#34;]
* Delete
  * azurerm_role_assignment.acme-vault-access
  * azurerm_role_assignment.acme-vault-reader




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.acme-vault-access will be destroyed
  # (because resource uses count or for_each)
  - resource "azurerm_role_assignment" "acme-vault-access" {
      - id                   = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-platform-sbox-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappssbox/providers/Microsoft.Authorization/roleAssignments/54e6bd11-3f35-2150-e879-d8698001e480" -> null
      - name                 = "54e6bd11-3f35-2150-e879-d8698001e480" -> null
      - principal_id         = "ff47ab8f-e4d9-48f2-ad31-af5933824849" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/providers/Microsoft.Authorization/roleDefinitions/4633458b-17de-408a-b874-0445c86b69e6" -> null
      - role_definition_name = "Key Vault Secrets User" -> null
      - scope                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-platform-sbox-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappssbox" -> null
    }

  # azurerm_role_assignment.acme-vault-access["d5bf08c7-2670-46db-b040-90a742b80316"] will be created
  + resource "azurerm_role_assignment" "acme-vault-access" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "d5bf08c7-2670-46db-b040-90a742b80316"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-platform-sbox-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappssbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.acme-vault-access["ff47ab8f-e4d9-48f2-ad31-af5933824849"] will be created
  + resource "azurerm_role_assignment" "acme-vault-access" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "ff47ab8f-e4d9-48f2-ad31-af5933824849"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-platform-sbox-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappssbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.acme-vault-reader will be destroyed
  # (because azurerm_role_assignment.acme-vault-reader is not in configuration)
  - resource "azurerm_role_assignment" "acme-vault-reader" {
      - id                   = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-platform-sbox-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappssbox/providers/Microsoft.Authorization/roleAssignments/47bf7a8d-e318-4fec-4e93-7b248dd4f45e" -> null
      - name                 = "47bf7a8d-e318-4fec-4e93-7b248dd4f45e" -> null
      - principal_id         = "d5bf08c7-2670-46db-b040-90a742b80316" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/providers/Microsoft.Authorization/roleDefinitions/21090545-7ca7-4776-b22c-e363652d74d2" -> null
      - role_definition_name = "Key Vault Reader" -> null
      - scope                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-platform-sbox-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappssbox" -> null
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":547,"Program":"tfcmt","SHA1":"","Target":"Managed_Identity","Vars":{}} -->